#include <iostream>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	cout << "¬ведите размер массива: ";
	int c = 3;    // начальное приращение сортировки
	int n; // длинна массива
	cin >> n;
	clock_t start, end;
	start = clock();
	int* a = new int[n];
	for (int i = 0; i < n; i++)
	{
		a[i] = rand() % 100; // заполн€ем массив случайными числами
		cout << a[i] << "  "; // вывод массива на экран
	}
	cout << "\n";
	int buff = 0;	// дл€ хранени€ перемещаемого значени€
	int i, j;		// дл€ циклов		

	/************* Ќачало сортировки *******************/
	while (c > 0)  // пока существует приращение
	{
		for (int i = 0; i < n; i++)  // дл€ всех элементов массива
		{
			int j = i;          // сохран€ем индекс и элемент
			int temp = a[i];
			// просматриваем остальные элементы массива, отсто€щие от j-ого
			// на величину приращени€
			while ((j >= c) && (a[j - c] > temp))
			{  // пока отсто€щий элемент больше текущего
				a[j] = a[j - c]; // перемещаем его на текущую позицию
				j = j - c;       // переходим к следующему отсто€щему элементу
			}
			a[j] = temp; // на вы€вленное место помещаем сохранЄнный элемент
		}
		if (c > 1)      // делим приращение на 2
			c = c / 2;
		else if (c == 1)   // последний проход завершЄн,
			break;  // выходим из цикла
	}
	/*************  онец сортировки *******************/

	for (int i = 0; i < n; i++) // вывод отсортированного массива
		cout << a[i] << "  ";
	cout << endl;
	end = clock();
	printf("¬рем€ выполнение программы %.4f (s)\n", ((double)end - start) / ((double)CLOCKS_PER_SEC));

}